{"format": "layers-model", "generatedBy": "keras v3.8.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 128], "dtype": "int32", "sparse": false, "name": "attention_mask"}, "name": "attention_mask", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_shape": [null, 128], "dtype": "int32", "sparse": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "function": {"class_name": "__lambda__", "config": {"code": "4wEAAAAAAAAAAAAAAAMAAAADAAAA8ywAAACXAHQBAAAAAAAAAAAAAHwApgEAAKsBAAAAAAAAAABk\nARkAAAAAAAAAAABTACkCTukAAAAAKQHaCmJlcnRfbW9kZWwpAdoBeHMBAAAAIPofPGlweXRob24t\naW5wdXQtMTQtYTA2ZTEzZTNjNGY1PvoIPGxhbWJkYT5yBgAAAA8AAABzEQAAAIAApVqwAaFdpF2w\nMdQlNYAA8wAAAAA=\n", "defaults": null, "closure": null}}, "output_shape": [128, 768], "arguments": {}}, "name": "lambda", "inbound_nodes": [{"args": [{"input_ids": {"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "int32", "keras_history": ["input_ids", 0, 0]}}, "attention_mask": {"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "int32", "keras_history": ["attention_mask", 0, 0]}}}], "kwargs": {"mask": {"input_ids": null, "attention_mask": null}}}]}, {"class_name": "GetItem", "config": {"name": "get_item"}, "name": "get_item", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 768], "dtype": "float32", "keras_history": ["lambda", 0, 0]}}, [{"class_name": "__slice__", "config": {"start": null, "stop": null, "step": null}}, 0, {"class_name": "__slice__", "config": {"start": null, "stop": null, "step": null}}]], "kwargs": {}}]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.5, "seed": null, "noise_shape": null}, "name": "dropout", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 768], "dtype": "float32", "keras_history": ["get_item", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 768], "dtype": "float32", "keras_history": ["dropout", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "emotion_output", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 28, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "emotion_output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 768], "dtype": "float32", "keras_history": ["dropout", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "valence_arousal", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 2, "activation": "tanh", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "valence_arousal", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_ids", 0, 0], ["attention_mask", 0, 0]], "output_layers": [["emotion_output", 0, 0], ["valence_arousal", 0, 0]]}}, "training_config": {"loss": {"emotion_output": "binary_crossentropy", "valence_arousal": "mse"}, "loss_weights": {"emotion_output": 1.0, "valence_arousal": 0.5}, "metrics": {"emotion_output": [{"class_name": "BinaryAccuracy", "config": {"name": "accuracy", "dtype": "float32", "threshold": 0.5}}, {"class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}], "valence_arousal": [{"class_name": "MeanAbsoluteError", "config": {"name": "mae", "dtype": "float32"}}]}, "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 9.999999747378752e-06, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [768, 128], "dtype": "float32"}, {"name": "dense/bias", "shape": [128], "dtype": "float32"}, {"name": "emotion_output/kernel", "shape": [768, 28], "dtype": "float32"}, {"name": "emotion_output/bias", "shape": [28], "dtype": "float32"}, {"name": "valence_arousal/kernel", "shape": [128, 2], "dtype": "float32"}, {"name": "valence_arousal/bias", "shape": [2], "dtype": "float32"}]}]}